# ♟️ Pandas Pivot Table

#### » Importing the required liblaries

In [3]:
import pandas as pd
import seaborn as sns

#### » Loading Titanic dataset from seaborn

In [4]:
titanic = sns.load_dataset("titanic")

#### » Displaying first few rows of the dataset

In [5]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

#### » Calculating survival rate by both gender and class using groupby
⚠️ Setting `observed=False` ensures all categories are preserved (even if some combinations are missing)

In [9]:
titanic.groupby(["sex", "class"], observed=False)[["survived"]].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

#### » Rearranged version: index as sex, columns as class

In [10]:
titanic.groupby(["sex", "class"], observed=False)[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

#### » Equivalent pivot table version (cleaner syntax)

In [13]:
titanic.pivot_table("survived", index="sex", columns="class",  observed=False)

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

#### » Creating a multi-index pivot table

In [14]:
age = pd.cut(titanic["age"], [0,18,90])

In [15]:
age.head(10)

0    (18.0, 90.0]
1    (18.0, 90.0]
2    (18.0, 90.0]
3    (18.0, 90.0]
4    (18.0, 90.0]
5             NaN
6    (18.0, 90.0]
7     (0.0, 18.0]
8    (18.0, 90.0]
9     (0.0, 18.0]
Name: age, dtype: category
Categories (2, interval[int64, right]): [(0, 18] < (18, 90]]

In [16]:
titanic.pivot_table("survived", ["sex", age], "class",  observed=False)

class               First    Second     Third
sex    age
female (0, 18]   0.909091  1.000000  0.511628
       (18, 90]  0.972973  0.900000  0.423729
male   (0, 18]   0.800000  0.600000  0.215686
       (18, 90]  0.375000  0.071429  0.133663